In [1]:
import pandas as pd
import opendatasets as od
import numpy as np

In [ ]:
#sankha subhra mondal

In [2]:
od.download("https://www.kaggle.com/datasets/sankha1998/student-semester-result")

Please provide your Kaggle credentials to download this dataset. Learn more: http://bit.ly/kaggle-creds
Your Kaggle username:

  patilsanuuu

Your Kaggle Key:

  ········

Dataset URL: https://www.kaggle.com/datasets/sankha1998/student-semester-result
Downloading student-semester-result.zip to .\student-semester-result

100%|██████████| 2.41k/2.41k [00:00<00:00, 816kB/s]

In [3]:
df=pd.read_csv('student-semester-result/data.csv')

In [4]:
print(df)

      1st   2nd   3rd   4th   5th  College Code  Gender     Roll  Roll no.  \
0    8.11  7.68  7.11  7.43  8.18           115  Female      NaN   17020.0
1    6.48  5.90  4.15  4.29  4.96           115    Male      NaN   17021.0
2    8.41  8.24  7.52  8.25  7.75           115  Female      NaN   17022.0
3    7.33  6.83  6.33  6.79  6.89           115    Male      NaN   17023.0
4    7.89  7.34  7.22  7.32  7.46           115    Male      NaN   17024.0
..    ...   ...   ...   ...   ...           ...     ...      ...       ...
173  7.48  7.55  7.67  7.39  8.65           241       F  17048.0       NaN
174  7.30  6.41  6.59  7.11  7.38           241       M  17049.0       NaN
175  6.30  6.28  5.89  5.71  6.50           241       M  17050.0       NaN
176  7.04  7.10  6.81  7.00  6.92           241       M  17051.0       NaN
177  6.70  6.81  6.52  5.39  7.00           241       M  17052.0       NaN

     Subject Code
0              16
1              16
2              16
3              16
4              16
..            ...
173            28
174            28
175            28
176            28
177            28

[178 rows x 10 columns]

In [5]:
df.head()

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   1st           176 non-null    float64
 1   2nd           174 non-null    float64
 2   3rd           176 non-null    float64
 3   4th           173 non-null    float64
 4   5th           172 non-null    float64
 5   College Code  178 non-null    int64
 6   Gender        177 non-null    object
 7   Roll          132 non-null    float64
 8   Roll no.      46 non-null     float64
 9   Subject Code  178 non-null    int64
dtypes: float64(7), int64(2), object(1)
memory usage: 14.0+ KB

In [7]:
df.isnull().sum()

1st               2
2nd               4
3rd               2
4th               5
5th               6
College Code      0
Gender            1
Roll             46
Roll no.        132
Subject Code      0
dtype: int64

In [9]:
avg_1=df['1st'].astype('float64').mean(axis=0)
avg_2=df['2nd'].astype('float64').mean(axis=0)
avg_3=df['3rd'].astype('float64').mean(axis=0)
avg_4=df['4th'].astype('float64').mean(axis=0)
avg_5=df['5th'].astype('float64').mean(axis=0)

In [10]:
print('average of 1st semester',avg_1)
print('average of 2nd semester',avg_2)
print('average of 3rd semester',avg_3)
print('average of 4th semester',avg_4)
print('average of 5th semester',avg_5)

average of 1st semester 7.038863636363637
average of 2nd semester 6.943390804597701
average of 3rd semester 6.6225
average of 4th semester 7.027745664739886
average of 5th semester 7.432558139534884

In [11]:
df['1st'].replace(np.nan,avg_1,inplace=True)
df['2nd'].replace(np.nan,avg_2,inplace=True)
df['3rd'].replace(np.nan,avg_3,inplace=True)
df['4th'].replace(np.nan,avg_4,inplace=True)
df['5th'].replace(np.nan,avg_5,inplace=True)

In [12]:
df.isnull().sum()

1st               0
2nd               0
3rd               0
4th               0
5th               0
College Code      0
Gender            1
Roll             46
Roll no.        132
Subject Code      0
dtype: int64

In [13]:
df['Gender'].replace(np.nan,"Female",inplace=True)

In [14]:
df.isnull().sum()

1st               0
2nd               0
3rd               0
4th               0
5th               0
College Code      0
Gender            0
Roll             46
Roll no.        132
Subject Code      0
dtype: int64

In [15]:
max1=df['1st'].max()
max2=df['2nd'].max()
max3=df['3rd'].max()
max4=df['4th'].max()
max5=df['5th'].max()

In [16]:
print(max1,max2,max3,max4,max5)

9.15 9.21 9.59 9.31 9.46

In [17]:
cgpa=['1st','2nd','3rd','4th','5th']
max_values=[max1,max2,max3,max4,max5]

In [18]:
for cg,mv in zip(cgpa,max_values):
    df[cg+"_percentage"]=(df[cg]/mv)*100

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   1st             178 non-null    float64
 1   2nd             178 non-null    float64
 2   3rd             178 non-null    float64
 3   4th             178 non-null    float64
 4   5th             178 non-null    float64
 5   College Code    178 non-null    int64
 6   Gender          178 non-null    object
 7   Roll            132 non-null    float64
 8   Roll no.        46 non-null     float64
 9   Subject Code    178 non-null    int64
 10  1st_percentage  178 non-null    float64
 11  2nd_percentage  178 non-null    float64
 12  3rd_percentage  178 non-null    float64
 13  4th_percentage  178 non-null    float64
 14  5th_percentage  178 non-null    float64
dtypes: float64(12), int64(2), object(1)
memory usage: 21.0+ KB

In [20]:
df.head(10)

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code,1st_percentage,2nd_percentage,3rd_percentage,4th_percentage,5th_percentage
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16,88.633880,83.387622,74.139729,79.806660,86.469345
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16,70.819672,64.060803,43.274244,46.079484,52.431290
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16,91.912568,89.467970,78.415016,88.614393,81.923890
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16,80.109290,74.158523,66.006257,72.932331,72.832981
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16,86.229508,79.695983,75.286757,78.625134,78.858351
5,7.33,6.72,6.48,6.50,7.39,115,Male,NaN,17025.0,16,80.109290,72.964169,67.570386,69.817401,78.118393
6,7.15,6.72,6.89,6.86,7.64,115,Male,NaN,17026.0,16,78.142077,72.964169,71.845673,73.684211,80.761099
7,6.74,6.38,4.93,5.64,6.75,115,Male,NaN,17027.0,16,73.661202,69.272530,51.407716,60.580021,71.353066
8,7.89,7.45,6.96,7.71,8.00,115,Female,NaN,17028.0,16,86.229508,80.890337,72.575600,82.814178,84.566596
9,7.30,6.34,6.30,6.61,6.18,115,Male,NaN,17029.0,16,79.781421,68.838219,65.693431,70.998926,65.327696